cesanta/mongoose/tutorials/stm32/nucleo-h723zg/cubemx/Drivers/STM32H7xx_HAL_Driver/Inc/stm32h7xx_hal_rcc_ex.h
#if defined(HRTIM1)
  uint32_t Hrtim1ClockSelection;      /*!< Specifies HRTIM1 Clock clock source
                                        This parameter can be a value of @ref RCCEx_HRTIM1_Clock_Source   */
#endif /* HRTIM1 */

  uint32_t TIMPresSelection;       /*!< Specifies TIM Clock Prescalers Selection.
                                       This parameter can be a value of @ref RCCEx_TIM_Prescaler_Selection */
} RCC_PeriphCLKInitTypeDef;

/*!< Alias for Inter STM32H7 lines compatibility regarding RCC_PeriphCLKInitTypeDef field : I2C5 available on some lines only  */
#if defined(I2C5)
#define I2c123ClockSelection I2c1235ClockSelection
#else
#define I2c1235ClockSelection I2c123ClockSelection
#endif /*I2C5*/


/**
  * @brief RCC_CRS Init structure definition
  */
typedef struct
{
  uint32_t Prescaler;             /*!< Specifies the division factor of the SYNC signal.
                                     This parameter can be a value of @ref RCCEx_CRS_SynchroDivider  */

  uint32_t Source;                /*!< Specifies the SYNC signal source.
                                     This parameter can be a value of @ref RCCEx_CRS_SynchroSource   */

  uint32_t Polarity;              /*!< Specifies the input polarity for the SYNC signal source.
                                     This parameter can be a value of @ref RCCEx_CRS_SynchroPolarity */

  uint32_t ReloadValue;           /*!< Specifies the value to be loaded in the frequency error counter with each SYNC event.
                                      It can be calculated in using macro __HAL_RCC_CRS_RELOADVALUE_CALCULATE(__FTARGET__, __FSYNC__)
                                     This parameter must be a number between 0 and 0xFFFF or a value of @ref RCCEx_CRS_ReloadValueDefault .*/

  uint32_t ErrorLimitValue;       /*!< Specifies the value to be used to evaluate the captured frequency error value.
                                     This parameter must be a number between 0 and 0xFF or a value of @ref RCCEx_CRS_ErrorLimitDefault */

  uint32_t HSI48CalibrationValue; /*!< Specifies a user-programmable trimming value to the HSI48 oscillator.
                                     This parameter must be a number between 0 and 0x3F or a value of @ref RCCEx_CRS_HSI48CalibrationDefault */

} RCC_CRSInitTypeDef;

/**
  * @brief RCC_CRS Synchronization structure definition
  */
typedef struct
{
  uint32_t ReloadValue;           /*!< Specifies the value loaded in the Counter reload value.
                                     This parameter must be a number between 0 and 0xFFFF */

  uint32_t HSI48CalibrationValue; /*!< Specifies value loaded in HSI48 oscillator smooth trimming.
                                     This parameter must be a number between 0 and 0x3F */

  uint32_t FreqErrorCapture;      /*!< Specifies the value loaded in the .FECAP, the frequency error counter
                                                                    value latched in the time of the last SYNC event.
                                    This parameter must be a number between 0 and 0xFFFF */

  uint32_t FreqErrorDirection;    /*!< Specifies the value loaded in the .FEDIR, the counting direction of the
                                                                    frequency error counter latched in the time of the last SYNC event.
                                                                    It shows whether the actual frequency is below or above the target.
                                    This parameter must be a value of @ref RCCEx_CRS_FreqErrorDirection*/

} RCC_CRSSynchroInfoTypeDef;

/**
  * @}
  */


/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants  RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_Periph_Clock_Selection  RCCEx Periph Clock Selection
  * @{
  */

#if defined(UART9) && defined(USART10)
#define RCC_PERIPHCLK_USART16910       ((uint64_t)(0x00000001U))
#define RCC_PERIPHCLK_USART1           RCC_PERIPHCLK_USART16910
#define RCC_PERIPHCLK_USART6           RCC_PERIPHCLK_USART16910
#define RCC_PERIPHCLK_UART9            RCC_PERIPHCLK_USART16910
#define RCC_PERIPHCLK_USART10          RCC_PERIPHCLK_USART16910
/*alias*/
#define RCC_PERIPHCLK_USART16          RCC_PERIPHCLK_USART16910
#else
#define RCC_PERIPHCLK_USART16          ((uint64_t)(0x00000001U))
#define RCC_PERIPHCLK_USART1           RCC_PERIPHCLK_USART16
#define RCC_PERIPHCLK_USART6           RCC_PERIPHCLK_USART16
/* alias */
#define RCC_PERIPHCLK_USART16910       RCC_PERIPHCLK_USART16
#endif /* UART9 && USART10*/
#define RCC_PERIPHCLK_USART234578      ((uint64_t)(0x00000002U))
#define RCC_PERIPHCLK_USART2           RCC_PERIPHCLK_USART234578
#define RCC_PERIPHCLK_USART3           RCC_PERIPHCLK_USART234578
#define RCC_PERIPHCLK_UART4            RCC_PERIPHCLK_USART234578
#define RCC_PERIPHCLK_UART5            RCC_PERIPHCLK_USART234578
#define RCC_PERIPHCLK_UART7            RCC_PERIPHCLK_USART234578
#define RCC_PERIPHCLK_UART8            RCC_PERIPHCLK_USART234578
#define RCC_PERIPHCLK_LPUART1          ((uint64_t)(0x00000004U))
#if defined(I2C5)
#define RCC_PERIPHCLK_I2C1235          ((uint64_t)(0x00000008U))
#define RCC_PERIPHCLK_I2C1             RCC_PERIPHCLK_I2C1235
#define RCC_PERIPHCLK_I2C2             RCC_PERIPHCLK_I2C1235
#define RCC_PERIPHCLK_I2C3             RCC_PERIPHCLK_I2C1235
/* alias */
#define RCC_PERIPHCLK_I2C123           RCC_PERIPHCLK_I2C1235
#else
#define RCC_PERIPHCLK_I2C123           ((uint64_t)(0x00000008U))
#define RCC_PERIPHCLK_I2C1             RCC_PERIPHCLK_I2C123
#define RCC_PERIPHCLK_I2C2             RCC_PERIPHCLK_I2C123
#define RCC_PERIPHCLK_I2C3             RCC_PERIPHCLK_I2C123
#endif /*I2C5*/
#define RCC_PERIPHCLK_I2C4             ((uint64_t)(0x00000010U))
#if defined(I2C5)
#define RCC_PERIPHCLK_I2C5             RCC_PERIPHCLK_I2C1235
#endif /*I2C5*/
#define RCC_PERIPHCLK_LPTIM1           ((uint64_t)(0x00000020U))
#define RCC_PERIPHCLK_LPTIM2           ((uint64_t)(0x00000040U))
#define RCC_PERIPHCLK_LPTIM345         ((uint64_t)(0x00000080U))
#define RCC_PERIPHCLK_LPTIM3           RCC_PERIPHCLK_LPTIM345
#if defined(LPTIM4)
#define RCC_PERIPHCLK_LPTIM4           RCC_PERIPHCLK_LPTIM345
#endif /*LPTIM4*/
#if defined(LPTIM5)
#define RCC_PERIPHCLK_LPTIM5           RCC_PERIPHCLK_LPTIM345
#endif /*LPTIM5*/
#define RCC_PERIPHCLK_SAI1             ((uint64_t)(0x00000100U))
#if defined(SAI3)
#define RCC_PERIPHCLK_SAI23            ((uint64_t)(0x00000200U))
#define RCC_PERIPHCLK_SAI2             RCC_PERIPHCLK_SAI23
#define RCC_PERIPHCLK_SAI3             RCC_PERIPHCLK_SAI23
#endif /* SAI3 */
#if defined(RCC_CDCCIP1R_SAI2ASEL_0)
#define RCC_PERIPHCLK_SAI2A            ((uint64_t)(0x00000200U))
#endif /* RCC_CDCCIP1R_SAI2ASEL_0 */
#if defined(RCC_CDCCIP1R_SAI2BSEL_0)
#define RCC_PERIPHCLK_SAI2B            ((uint64_t)(0x00000400U))
#endif /* RCC_CDCCIP1R_SAI2BSEL_0 */
#if defined(SAI4)
#define RCC_PERIPHCLK_SAI4A            ((uint64_t)(0x00000400U))
#define RCC_PERIPHCLK_SAI4B            ((uint64_t)(0x00000800U))
#endif /* SAI4 */
#define RCC_PERIPHCLK_SPI123           ((uint64_t)(0x00001000U))
#define RCC_PERIPHCLK_SPI1             RCC_PERIPHCLK_SPI123
#define RCC_PERIPHCLK_SPI2             RCC_PERIPHCLK_SPI123
#define RCC_PERIPHCLK_SPI3             RCC_PERIPHCLK_SPI123
#define RCC_PERIPHCLK_SPI45            ((uint64_t)(0x00002000U))
#define RCC_PERIPHCLK_SPI4             RCC_PERIPHCLK_SPI45
#define RCC_PERIPHCLK_SPI5             RCC_PERIPHCLK_SPI45
#define RCC_PERIPHCLK_SPI6             ((uint64_t)(0x00004000U))
#define RCC_PERIPHCLK_FDCAN            ((uint64_t)(0x00008000U))
#define RCC_PERIPHCLK_SDMMC            ((uint64_t)(0x00010000U))
#define RCC_PERIPHCLK_RNG              ((uint64_t)(0x00020000U))
#define RCC_PERIPHCLK_USB              ((uint64_t)(0x00040000U))
#define RCC_PERIPHCLK_ADC              ((uint64_t)(0x00080000U))
#define RCC_PERIPHCLK_SWPMI1           ((uint64_t)(0x00100000U))
#define RCC_PERIPHCLK_DFSDM1           ((uint64_t)(0x00200000U))
#if defined(DFSDM2_BASE)
#define RCC_PERIPHCLK_DFSDM2           ((uint64_t)(0x00000800U))
#endif /* DFSDM2 */
#define RCC_PERIPHCLK_RTC              ((uint64_t)(0x00400000U))
#define RCC_PERIPHCLK_CEC              ((uint64_t)(0x00800000U))
#define RCC_PERIPHCLK_FMC              ((uint64_t)(0x01000000U))
#if defined(QUADSPI)
#define RCC_PERIPHCLK_QSPI             ((uint64_t)(0x02000000U))
#endif /* QUADSPI */
#if defined(OCTOSPI1) || defined(OCTOSPI2)
#define RCC_PERIPHCLK_OSPI             ((uint64_t)(0x02000000U))
#endif /* defined(OCTOSPI1) || defined(OCTOSPI2) */
#define RCC_PERIPHCLK_DSI              ((uint64_t)(0x04000000U))
#define RCC_PERIPHCLK_SPDIFRX          ((uint64_t)(0x08000000U))
#if defined(HRTIM1)
#define RCC_PERIPHCLK_HRTIM1           ((uint64_t)(0x10000000U))
#endif /* HRTIM1 */
#if defined(LTDC)
#define RCC_PERIPHCLK_LTDC             ((uint64_t)(0x20000000U))
#endif /* LTDC */
#define RCC_PERIPHCLK_TIM              ((uint64_t)(0x40000000U))
#define RCC_PERIPHCLK_CKPER            ((uint64_t)(0x80000000U))

#define RCC_PERIPHCLK_PLL2_DIVP        ((uint64_t)(0x0000000100000000U))
#define RCC_PERIPHCLK_PLL2_DIVQ        ((uint64_t)(0x0000000200000000U))
#define RCC_PERIPHCLK_PLL2_DIVR        ((uint64_t)(0x0000000400000000U))
#define RCC_PERIPHCLK_PLL3_DIVP        ((uint64_t)(0x0000000800000000U))
#define RCC_PERIPHCLK_PLL3_DIVQ        ((uint64_t)(0x0000001000000000U))
#define RCC_PERIPHCLK_PLL3_DIVR        ((uint64_t)(0x0000002000000000U))

/**
  * @}
  */


